In [1]:
import numpy as np
import pandas as pd

In [9]:
data = {'Company':['FB','FB','GOOG','GOOG','MSFT','MSFT'],
        'Person':['Charley','Tom','Megan','Jared','Aubrey','Ravi']
        ,'Sales':[450,123,67,340,235,89]}

In [10]:
data

{'Company': ['FB', 'FB', 'GOOG', 'GOOG', 'MSFT', 'MSFT'],
 'Person': ['Charley', 'Tom', 'Megan', 'Jared', 'Aubrey', 'Ravi'],
 'Sales': [450, 123, 67, 340, 235, 89]}

In [11]:
df = pd.DataFrame(data)

In [12]:
df

  Company   Person  Sales
0      FB  Charley    450
1      FB      Tom    123
2    GOOG    Megan     67
3    GOOG    Jared    340
4    MSFT   Aubrey    235
5    MSFT     Ravi     89

In [14]:
byComp = df.groupby('Company')

In [16]:
byComp.max()

        Person  Sales
Company
FB         Tom    450
GOOG     Megan    340
MSFT      Ravi    235

In [17]:
byComp.min()

          Person  Sales
Company
FB       Charley    123
GOOG       Jared     67
MSFT      Aubrey     89

In [19]:
byComp.std()

              Sales
Company
FB       231.223917
GOOG     193.040151
MSFT     103.237590

In [22]:
byComp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  286.5  231.223917  123.0  204.75  286.5  368.25  450.0
GOOG      2.0  203.5  193.040151   67.0  135.25  203.5  271.75  340.0
MSFT      2.0  162.0  103.237590   89.0  125.50  162.0  198.50  235.0

In [23]:
byComp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [24]:
byComp.sum()

         Sales
Company
FB         573
GOOG       407
MSFT       324

In [25]:
byComp.mean()

         Sales
Company
FB       286.5
GOOG     203.5
MSFT     162.0

In [28]:
df.groupby('Company').describe().transpose()['GOOG']

Sales  count      2.000000
       mean     203.500000
       std      193.040151
       min       67.000000
       25%      135.250000
       50%      203.500000
       75%      271.750000
       max      340.000000
Name: GOOG, dtype: float64

In [29]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [30]:
df.groupby('Company').sum()

         Sales
Company
FB         573
GOOG       407
MSFT       324

In [31]:
df.groupby('Company').mean()

         Sales
Company
FB       286.5
GOOG     203.5
MSFT     162.0

In [32]:
df.groupby('Company').std()

              Sales
Company
FB       231.223917
GOOG     193.040151
MSFT     103.237590

In [35]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG       MSFT
Sales count    2.000000    2.000000    2.00000
      mean   286.500000  203.500000  162.00000
      std    231.223917  193.040151  103.23759
      min    123.000000   67.000000   89.00000
      25%    204.750000  135.250000  125.50000
      50%    286.500000  203.500000  162.00000
      75%    368.250000  271.750000  198.50000
      max    450.000000  340.000000  235.00000